Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་བློ་བཟངས་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་སྒྲོན་དེ་ལ། །ཨ་རུ་ར་ཡི་འབྲས་བུ་དགུ་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Subuddhi, when a physician, Offered nine yellow myrobalan fruits To the thus-gone Jewel Lamp And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྟོབས་བྱིན་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་འབར་བ་ཡི། །གཙུག་ལག་ཁང་དག་སྐྱོང་ནུལ་བྱུགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Baladatta, when the son of a merchant, Coated with plaster a monastic temple Of the thus-gone Blazing Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེ་སྟབས་ནི་རྒྱ་མཚོའི་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟིགས་པ་ཐ་མ་དེ་ལ་ནི། །བྱི་རུ་སྤར་བ་བཀང་སྟེ་གཏོར་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhagati, when a seafaring merchant, Scattered handfuls of coral Before the thus-gone Final Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་ཏོག་ནི་རྒྱལ་རིགས་གཞོན་ནུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབྱིག་ལ་དགྱེས་པ་དེ་ལ་ནི། །རིན་པོ་ཆེ་ཡི་ཕྲེང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṣpaketu, when a youth of the kṣatriya caste, Offered jewel garlands To the thus-gone Delighting in Treasure And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་འབྱུང་གནས་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པ་མཛེས་དེ་ལ། །པད་མའི་རྫིང་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānākara, when a garland maker, Offered lotus ponds To the thus-gone Beautiful Array And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་བྱིན་པ་གནས་རྟེན་ཚེ། །བདེ་གཤེགས་ཡོན་ཏན་དཔལ་གྱི་སྙིང་པོ་ཡི། །འཆག་སར་འཇི་བའི་གོང་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṣpadatta, when a senior monk, Offered lumps of clay for a monastic walkway To the well-gone Essence of Glorious Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་སྙིང་པོ་དྲང་སྲོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟིགས་པ་གསལ་དེ་ལ། །རྒྱང་མ་ནས་ནི་ཐལ་སྦྱར་ཕྱག་བྱས་ཏེ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇagarbha, when a sage, Joined his palms in homage from a distance Before the thus-gone Clear Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་གྲགས་པ་ཤིང་རྟོག་ཚེ། །དེ་བཞིན་གཤེགས་པ་མདངས་སྟོབས་དེ་ལ་ནི། །ཨ་ཏི་མུག་ཏའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Yaśoratna, when looking after trees, Scattered atimukta flowers Before the thus-gone Bright Strength And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྲགས་པ་རྨད་བྱུང་རྫ་མཁན་གྱི། །བུ་ཚེ་བདེ་གཤེགས་རྣམ་དག་སྤྱན་དེ་ལ། །ཆུ་ཡི་སྦྱིན་པ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Adbhutayaśas, when the son of a potter, Offered water To the well-gone Eyes of Purity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མི་ཚུགས་དམངས་རིགས་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་བརྟུལ་ཞུགས་ལ། །བ་རུ་ར་ཡི་འབྲས་བུ་གཅིག་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anihata, when youth of the commoner caste, Offered a bibhītaka fruit To the thus-gone Yogic Discipline of Wisdom And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསྙེངས་མེད་རྒྱལ་ཆེན་རྣམ་ཐོས་བུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཞབས་དག་བརྟན་པ་དེ་ལ་ནི། །ལྷ་རྫས་དག་གི་ཙན་དན་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Abhaya, when Vaiśravaṇa, Scattered sandalwood of heavenly substance Before the thus-gone Steadfast Feet And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཉི་མའི་འོད་ནི་རྒྱལ་པོ་ཡི། །མདུན་འདོན་བྱེད་ཚེ་བདེ་གཤེགས་འཕགས་སྤྱན་དེ། །ཞག་བདུན་བར་དུ་གདུགས་ཚོད་གསོལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sūryaprabha, when a royal priest, Offered lunch for seven days To the well-gone Noble Eye And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚངས་རབ་གཤེགས་པ་མཉན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐར་པ་དགྱེས་དེ་ལ། །ཆུ་བོའི་འགྲམ་དག་བསྟན་ཅིང་མཚོན་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Brahmagāmin, when a ferryman, Pointed out the bank of a river To the thus-gone Delighting in LiberationAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་ཡི་མཐུ་རྩལ་ཚོང་དཔོན་ཚེ། །ཕྱོགས་བཞིའི་དགེ་འདུན་སྒོ་གང་ཕུབ་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་དབྱངས་ཆེན་དེ་ལ་ནི། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vikrāntadeva, when a merchant, Erected a gateway for the saṅgha of the four directions Before the thus-gone Great Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་དགྱེས་པ་རྡོ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡུལ་འཁོར་མཆོག་དེ་ལ། །ལྷ་ཡི་ཞལ་ཟས་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānapriya, when a stonemason, Offered divine meals To the thus-gone Supreme Land And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་བདེན་སྨན་རྩ་འཚོང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་པར་སྤྱོད་པའི་འོད་དེ་ནི། །སྙུན་གྱི་གསོས་སྨན་དག་ལ་རྟག་ཏུ་སྤྱན་དྲངས་ནས། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Satyadeva, when a vendor of medicinal herbs, Offered medical supplies To the thus-gone Light of Excellent Conduct And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ནོར་བུའི་སྙིང་པོ་ཉ་བ་ཡི། །ཁྱེའུ་ཚེ་བདེ་གཤེགས་ས་རི་ལས་དེ་ལ། །མེ་ཏོག་བཞི་ཞིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnagarbha, when a young fisherman, Offered four flowers To the well-gone Action of Svāti And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་གྲགས་པ་དཀའ་སྤྱོད་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་གསལ་དེ་ལ། །ཞུགས་ལིང་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇakīrti, when undertaking austerities, Offered a vessel for coals To the thus-gone Luminous Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་དཔལ་ནི་བཅའ་བ་མཁན་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་གྲགས་དེ་ལ། །ལྷུང་བཟེད་བཅའ་བ་དག་གིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānaśrī, when the son of a cook, Offered an alms bowl filled with food To the thus-gone Famed Illuminator And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བཅིངས་མེད་རྟེན་བཅས་གཅིག་པུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྣང་བའི་མཆོག་དེ་ལ། །གདུགས་ཚོད་གསོལ་ཏེ་སྦྲང་མ་བསྐྲད་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Asita, when having a single support, Offered lunch and drove away bees Before the thus-gone Supreme Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བརྟུལ་ཞུགས་བརྟན་པ་བློན་ཆེན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྱེས་པར་གཟིགས་དེ་ལ། །ཁང་པ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dṛḍhavrata, when a chief minister, Offered houses To the thus-gone Delightful Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་ཡི་གཟི་བརྗིད་དམ་ཆོས་ནུབ་པའི་ཚེ། །དགེ་སློང་ཆོས་སྨྲོས་ཤིག་སྨྲོས་ཤིག་ཅེས་བརྗོད་ནས། །དེ་བཞིན་གཤེགས་པ་ཟླ་བ་ལྟ་བུར་གསུང་དེ་ལ། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Maruttejas, when the sacred Dharma was fading, Called on Dharma-teaching monks to ‘Teach! Teach!’ Before the thus-gone Moonlike Speech And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚངས་པར་ཐུབ་པ་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བླ་མའི་དབྱངས་དེ་ལ། །གྲོང་ཁྱེར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Brahmamuni, when a king, Offered cities To the thus-gone Highest Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དལ་བཞུད་དགེ་སློང་རྐྱེན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་དཔལ་དེ་ལ། །སོ་བི་ར་ཀའི་བཏུང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śanairgāmin, when a dependent monk, Offered vinegar To the thus-gone Glorious Merit And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བརྟུལ་ཞུགས་དཀའ་ཐུབ་ཕྱག་དར་པ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསྡུ་བ་མཁྱེན་པ་པོ་དེ་ཡི། །ལམ་སྲང་ཁྲུ་བཅུ་སྲིད་དུ་ཕྱག་དར་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vratatapas, when a sweeper, Swept ten cubits of road Before the thus-gone Knower of the Gathering And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་ཕུང་པོ་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཚན་གྱི་རྒྱལ་པོ་དེ། །འཇིགས་པ་མེད་པས་དགོན་པར་སྤྱན་དྲངས་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arciskandha, when a householder, Without fear led the thus-gone King of Marks Into the remote forest, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་ཆེན་པོ་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རིམས་ནད་མེད་པ་ཡི། །བློ་མངའ་དེ་ལ་རྒྱན་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahātejas, when a prince, Offered ornaments To the thus-gone Master of Mind Without Contagion And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཙམ་པ་ཀ་ནི་རྒྱལ་ཕྲན་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཕགས་པ་དུལ་བ་ལ། །མུ་སྣི་ཀ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Campaka, when a minor king, Offered mu sni ka To the thus-gone Superior Taming And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དགའ་མཛད་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ལྷ་དེ་ལ། །རིལ་བ་སྤྱི་བླུགས་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Toṣaṇa, when a brahmin, Offered water pots To the thus-gone Dharma Deity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚོགས་ཅན་བཟང་པོ་ལྷ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་བདུད་རྩི་དེས། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཚེ་ལེགས་པ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sugaṇin, when a divine son, Presented fine offerings When the thus-gone Nectar of Qualities was turning the Dharma wheel And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དབང་པོའི་རྒྱལ་མཚན་མཆོད་སྡོང་སྲུང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐོགས་པ་མེད་པ་གྲོང་ཁྱེར་དུ། །གཤེགས་པའི་ཚེ་ན་མཆོད་སྡོང་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Indradhvaja, when the guardian of a shrine, Offered shrines when the thus-gone Unimpeded Entered the city And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དགྱེས་ཆེན་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་ཕུང་པོ་ལ། །སྨན་གྱི་རེང་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Mahāpriya, when a physician, Offered medicine tablets To the thus-gone Mass of Nectar And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྣ་མའི་མེ་ཏོག་འོད་ནི་གར་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་ལྡན་དེ་ལ་ནི། །སྣ་མའི་མེ་ཏོག་དག་གི་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sumanā­puṣpa­prabha, when a dancer, Offered a garland of sumanā flowers To the thus-gone Possessor of Moonlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚོགས་ཅན་འོད་ནི་ཆང་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་འབྲུག་སྒྲ་དེ་ལ་ནི། །ཕྱེ་མས་བསྒོས་པའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gaṇiprabha, when an alcohol seller, Scattered flowers suffused with fragrant powder Before the thus-gone Sound of Thunder And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྐྲུན་མཛད་ཤིང་ལྷའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགེ་བའི་ཉི་མ་ལ། །མེ་ཏོག་ཀར་ནི་ཀ་དག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Creator, when a tree god, Scattered karṇikā flowers Before the thus-gone Sun of Virtue And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མདངས་འགྲོ་ཤིང་རྟ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མི་བསྙེངས་ཐོབ་དེ་ལ། །བཞུགས་ཁྲིའུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ojaṅgama, when a chariot maker, Offered couches To the thus-gone Attainment of Fearlessness And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་ལེགས་ངེས་ནི་རྫ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཁས་པ་དགྱེས་དེ་ལ། །ཞག་གཅིག་བཞུགས་པའི་གནས་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Suviniścitārtha, when a potter, Offered a place to stay for one day To the thus-gone Delight in Learning And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཁྱུ་མཆོག་བློན་ཆེའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་མི་འཁྲུལ་དེ་ལ། །སེང་གེའི་གདན་ཁྲི་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ།། །།
en: “The well-gone Vṛṣabha, when the son of a chief minister, Offered a lion throne To the thus-gone Mind Free from Delusion And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལག་བཟངས་ཐམས་ཅད་བྱེད་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འགྲོ་བ་དགའ་དེ་ལ། །གོས་ཀྱི་དུམ་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Subāhu, when a jack of all trades, Offered pieces of garment To the thus-gone Joy for the World And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་ཆེན་པོ་ལག་བླའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་མཆོག་དེ་ལ། །སྐྱུ་རུ་ར་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahāraśmi, when a supervisor of a new building, Offered myrobalan fruit To the thus-gone Supreme Deity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསམ་པས་བྱིན་ནི་ཁྲུས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྫུ་འཕྲུལ་མཆོག་དེ་ལ། །ཕྱག་དག་བཀྲུ་བའི་ཆལ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Āśādatta, when a bath attendant, Offered bathing soap To the thus-gone Supreme Miracle And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་འོད་ནི་དབུལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་གདུགས་དེ་ལ། །བཤོས་དྲོན་བཅུད་དང་ལྡན་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇyābha, when a poor man, Offered a nutritious meal To the thus-gone Divine Parasol And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་དབྱངས་ནི་རི་མོ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་དག་ནི་བྲིས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ཀླུ་ཡི་འོད་ལྡན་དེ་ལ་ནི། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnaruta, when a painter, Drew a picture of the thus-gone one For the thus-gone Endowed with Nāga Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྡོ་རྗེའི་སྡེ་ནི་བཅིངས་པ་མེད་པ་པོ། །རལ་པ་ཅན་གྱི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་པོ། །མཐུ་རྩལ་དྲག་ཤུལ་ཅན་ལ་རྡོ་ལེབ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vajrasena, when a braided one without bonds, Offered a stone slab To the thus-gone Fierce Power And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འབྱོར་ལྡན་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་གཟི་བརྗིད་ལ། །ཙམ་པ་ཀ་ཡི་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Samṛddha, when a garland maker, Offered a garland of campaka flowers To the thus-gone Dharma Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་སྟོབས་ནི་ཕྱག་དར་པ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྲིད་པའི་མཐའ་ནི་གཟིགས་པ་པོ། །བཅོམ་ལྡན་དེ་ནི་ཕྲག་ལ་བླངས་ཏེ་འདམ་རྫབ་བསྒྲལ། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhabala, when a sweeper, Carried the blessed thus-gone Beholder of the Ends of Existence Across a swamp upon his shoulders, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྤྱན་ནི་འདྲི་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཁྲེལ་ཡོད་བཟང་པོ་ལ། །ཀ་ལ་མན་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Netra, when a scribe, Offered a reed pen To the thus-gone Excellent Modesty And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་སྲུང་སྦྱངས་གནས་དགེ་སློང་ཚེ། །བདེ་གཤེགས་རྒྱ་ཆེན་གཟུགས་ཀྱི་འཆག་ས་དག ། ལྷུང་བཟེད་འབྲུ་མར་བཀང་བས་ཆག་ཆག་བཏབ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kāśyapa, when a monk abiding by the training, Sprinkled a monastic walkway with oil from a full alms bowl Before the well-gone Vast Form And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བློ་གསལ་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་སྤྱན་དེ་ལ། །འོད་ཟེར་མེ་ཏོག་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Prasannabuddhi, when a prince, Offered radiant flowers To the thus-gone Divine Eye And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་འགྲོས་ནི་རྒྱ་མཚོའི་ཚོང་པའི་ཚེ། །ཉམ་ཐག་ཚེ་ན་སངས་རྒྱས་དག་ལ་ཕྱག་འཚལ་ཞེས། །ཚིག་ཏུ་བརྗོད་ནས་བདེ་གཤེགས་ཚོགས་ཀྱི་འོད་ཟེར་ལ། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānakrama, when a seafaring merchant, Cried out ‘Homage to the buddhas!’ while in distress Before the well-gone Radiance of the Gathering, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་དྲག་ཤུལ་མགར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་མཆོག་དེ་ལ། །དངུལ་ལས་བྱས་པའི་ལྷུང་བཟེད་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ugratejas, when a blacksmith, Offered a silver alms bowl To the thus-gone Supreme Moon And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་ཆེན་པོ་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཉམ་པར་བཞག་པའི་བདག་ཉིད་དེ། །ཉིན་གཅིག་བཞུགས་པའི་གནས་ནི་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahāraśmi, when the son of a merchant, Offered a place to stay for one day To the thus-gone Being of Equipoise And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཉི་འོད་གྲོང་རྡལ་བྱིས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཏོག་དེ་ཡི། །རས་ཀྱི་གདན་དག་གདིང་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sūryaprabha, when a child in a village, Spread out a cotton sitting mat For the thus-gone Crest of Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དྲི་མེད་འོད་ནི་མདུན་འདོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྐྱེ་དབང་མཚུངས་དེ་ལ། །མཆོད་སྦྱིན་དག་གི་ར་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vimalaprabha, when a priest, Offered sacrificial grounds To the thus-gone Equal of the Ruler And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་རྣམ་འབྱེས་ཆང་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཇིགས་མེད་བཤེས་གཉེན་ལ། །ཁ་རའི་བཏུང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vibhaktatejas, when an alcohol vendor, Offered a sugar drink To the thus-gone Fearless Friend And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཁེངས་མེད་རྩིས་པའི་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསྡུ་བའི་བློ་མངའ་ལ། །ཅི་ཙེའི་ཕུབ་མ་ཕྲག་སྟ་གང་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anuddhata, when a young astrologer, Offered a prastha of millet chaff To the thus-gone Master of Mental Composure And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྦྲང་རྩིའི་ཞལ་ནི་ལྷམ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྲ་ཐུལ་དེ་ལ་ནི། །མེ་ཏོག་ཨུད་པལ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Madhuvaktra, when a shoemaker, Offered utpala flowers To the thus-gone Subduer of the Enemy And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་འོད་རྟེན་བཅས་ནད་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟམ་པའི་འོད་དེ་ལ། །མོན་སྲན་གྲེའུ་རུལ་པ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Candraprabha, when suffering from a disease and dependent, Offered fermented māṣa beans To the thus-gone Luminous Bridge And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གློག་སྦྱིན་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རི་བོ་བརྩེགས་པ་ལ། །ཡིད་འཐད་ཁང་པ་བརྩེགས་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vidyuddatta, when a king, Offered a captivating multistoried house To the thus-gone Towering Mountain And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རབ་ཞིར་གཤེགས་པ་ཤིང་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྩེ་གཅིག་འོད་དེ་ལ། །ཆུ་དྲོན་སྣོད་དག་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Praśāntagāmin, when a timber merchant, Offered vessels of hot water To the thus-gone One-Pointed Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མི་འཁྲུགས་པ་ཡིས་དགེ་སློང་དག་ལ་ནི། །ཇི་སྲིད་འཚོ་བར་གནོད་སེམས་མེད་པར་འཛིན་བཅུག་ནས། །དེ་བཞིན་གཤེགས་པ་སྲེད་མེད་བུ་ཡི་མཐུ་རྩལ་ལ། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Akṣobhya Inspired monks to give up the wish to harm for as long as they lived Before the thus-gone Power of Nārāyaṇa And in so doing first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགྲ་བཅོམ་གྲགས་པ་རྫ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ཞབས་དེ་ལ། །སྤོས་ཀྱི་ཟ་མ་ཏོག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arhatkīrti, when a potter, Offered an incense casket To the thus-gone Lion Feet And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་ཀྱི་ཡོན་ཏན་ཕྱྭ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚུལ་ཁྲིམས་དགྱེས་དེ་ལ། །ཁང་པ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇadharma, when a fortune teller, Offered houses To the thus-gone Delighting in Discipline And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཞིང་བཟང་ལྷ་ཡི་བརྟུལ་ཞུགས་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསལ་དེ་ལ། །གུ་གུལ་བདུག་པ་དག་གིས་བདུགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Laḍitakṣetra, when adhering to the discipline of the gods, Burned frankincense Before the thus-gone Illuminator of the World And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བཀོད་པའི་རྒྱལ་པོ་འཁོར་སྒྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་དེ་ལ། །བཻ་དཱུརྱ་ཡི་ཁང་བཟངས་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vyūharāja, when a universal monarch, Offered a beryl mansion To the thus-gone Moonlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མངོན་འཕགས་ལྷ་ལ་དད་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེ་རྣམ་བསྒྱིངས་ལ། །མེ་ཏོག་དག་ལས་བྱས་པའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Abhyudgata, when having faith in the gods, Offered a parasol made of flowers To the thus-gone Striding Lion And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྦྱིན་སྲེག་འོད་འཕྲོ་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་རྙོག་མེད་ལ། །བཀད་ས་དག་ནི་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Hutārci, when a captain, Offered a dining hall To the thus-gone Immaculate Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་པད་དཔལ་ཕྱུག་པོའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་གྲགས་པ་གསལ་བ་པོ། །བདེ་བར་གཤེགས་ལ་པད་མའི་མེ་ཏོག་གཏོར། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Padmaśrī, when the son of a rich man, Scattered lotus flowers on the ground Before the thus-gone Clear Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་བཀོད་པ་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་ངེས་པའི་བློ་དེ་ལ། །ཁྲོན་པ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnavyūha, when a householder, Offered a well To the thus-gone Gentle Mind And in doing so first gave rise to the mind of awakening.
